lib/tasks/registro.rake

    task drivers_code: :environment do
        Driver.all.each do |driver|
            driver.code ="1-C"
            driver.save
---
SELECT "drivers".* FROM "drivers"
UPDATE "drivers" SET "updated_at" = $1, "code" = $2 WHERE "drivers"."id" = $3  [["updated_at", "2021-08-10 16:30:12.386392"], ["code", "1-C"], ["id", 1]]