app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @cars = Car.all

INSERT INTO "cars" ("model", "brand", "driverid", "alias", "created_at", "updated_at", "code") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["model", 7], ["brand", "Yotota"], ["driverid", 7], ["alias", "CR7"], ["created_at", "2021-08-10 16:35:03.539322"], ["updated_at", "2021-08-10 16:35:03.539322"], ["code", "7"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 17]]
---
  def destroy
    @car.destroy

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_car
      @car = Car.find(params[:id])